In [1]:
import pandas as pd
df = pd.read_csv("/Users/shridharmankar/age2.csv")
df.head(6)

   Age  Degrees  Income
0   50        5    5000
1   60        3    4500
2   10        1    7000
3   20        2    6000
4   40        7    3500
5   80        9    2000

In [2]:
x = df[['Age', 'Degrees']]
y = df['Income']
x

   Age  Degrees
0   50        5
1   60        3
2   10        1
3   20        2
4   40        7
5   80        9

In [3]:
y

0    5000
1    4500
2    7000
3    6000
4    3500
5    2000
Name: Income, dtype: int64

In [80]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.3,random_state=0)
X_train

   Age  Degrees
1   60        3
3   20        2
0   50        5
4   40        7

In [81]:
X_test

   Age  Degrees
5   80        9
2   10        1

In [82]:
from sklearn.linear_model import LinearRegression
clf = LinearRegression()

In [83]:
clf.fit(X_train, y_train)

LinearRegression()

In [84]:
clf.predict(X_test)

array([2314.81481481, 6555.55555556])

In [85]:
clf.score(X_test, y_test)

0.9762688614540466

In [77]:
clf.coef_

array([-5.60538117e-01, -5.70627803e+02])

In [78]:
clf.intercept_

7432.735426008969

In [79]:
clf.predict([[25,2]])

/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([6277.46636771])